//LABS 2
#include <iostream>
#include <cmath>
using namespace std;

int main()
{
    system("chcp 65001 > nul");
    const double eps = 1e-4;      // заданная точность
    double sum = 0;               // сумма ряда
    double a, fact;
    int n, i;
    n = 1;
    a = 1;                        // первый член ряда
    while (fabs(a) >= eps)        // цикл с предусловием
    {
        sum = sum + a;            // добавляем текущий член ряда
        n = n + 1;                // переходим к следующему члену
        fact = 1;                 // вычисляем факториал 
        for (i = 1; i <= 3 * n - 3; i++)
            fact = fact * i;
        a = n * n * n / fact;     // новый член ряда 
    }
    cout << "Сумма с точностью eps: " << sum << endl;
    cout << "Количество учитываемых членов: " << n - 1 << endl;

    return 0;
}

/*Цикл while выполняется, пока абсолютное значение текущего члена ряда |aₙ| не станет меньше ε = 10⁻⁴

Внутри цикла вложенным циклом for вычисляется факториал (3n−3)!

Каждый член ряда прибавляется к сумме, пока его величина не меньше точности ε*/
